bench-http/results/round1-fanout.hey.txt

Summary:
  Total:	15.0037 secs
  Slowest:	0.0312 secs
  Fastest:	0.0001 secs
  Average:	0.0038 secs
  Requests/sec:	13156.7318
  
  Total data:	394798 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [11037]	|■■
  0.006 [183967]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [2024]	|
  0.013 [262]	|
  0.016 [35]	|
  0.019 [26]	|
  0.022 [14]	|
  0.025 [29]	|
  0.028 [3]	|
  0.031 [1]	|


Latency distribution:
  10%% in 0.0033 secs
  25%% in 0.0034 secs
  50%% in 0.0036 secs
  75%% in 0.0039 secs
  90%% in 0.0045 secs
  95%% in 0.0049 secs
  99%% in 0.0066 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0041 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0023 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0038 secs, 0.0001 secs, 0.0312 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0023 secs

Status code distribution:
  [200]	197399 responses