bench-http/results/round1-sequential.hey.txt

Summary:
  Total:	15.0036 secs
  Slowest:	0.0242 secs
  Fastest:	0.0001 secs
  Average:	0.0033 secs
  Requests/sec:	15185.3404
  
  Total data:	455670 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [7667]	|■
  0.005 [217842]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.007 [2168]	|
  0.010 [108]	|
  0.012 [6]	|
  0.015 [6]	|
  0.017 [0]	|
  0.019 [20]	|
  0.022 [11]	|
  0.024 [6]	|


Latency distribution:
  10%% in 0.0028 secs
  25%% in 0.0030 secs
  50%% in 0.0031 secs
  75%% in 0.0035 secs
  90%% in 0.0041 secs
  95%% in 0.0043 secs
  99%% in 0.0050 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0075 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0025 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0004 secs
  resp wait:	0.0033 secs, 0.0001 secs, 0.0181 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0009 secs

Status code distribution:
  [200]	227835 responses