bench-http/results/round2-fanout.hey.txt

Summary:
  Total:	15.0035 secs
  Slowest:	0.0182 secs
  Fastest:	0.0001 secs
  Average:	0.0036 secs
  Requests/sec:	13960.5559
  
  Total data:	418914 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [981]	|
  0.004 [165710]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.006 [41378]	|■■■■■■■■■■
  0.007 [1234]	|
  0.009 [110]	|
  0.011 [11]	|
  0.013 [2]	|
  0.015 [7]	|
  0.016 [13]	|
  0.018 [10]	|


Latency distribution:
  10%% in 0.0033 secs
  25%% in 0.0034 secs
  50%% in 0.0035 secs
  75%% in 0.0037 secs
  90%% in 0.0039 secs
  95%% in 0.0042 secs
  99%% in 0.0052 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0031 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0017 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0001 secs
  resp wait:	0.0036 secs, 0.0001 secs, 0.0152 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0002 secs

Status code distribution:
  [200]	209457 responses