bench-http/results/round2-fanout.hey.txt

Summary:
  Total:	15.0035 secs
  Slowest:	0.0435 secs
  Fastest:	0.0001 secs
  Average:	0.0041 secs
  Requests/sec:	12291.6627
  
  Total data:	368836 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.004 [147862]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.009 [35105]	|■■■■■■■■■
  0.013 [1091]	|
  0.017 [173]	|
  0.022 [142]	|
  0.026 [40]	|
  0.031 [1]	|
  0.035 [2]	|
  0.039 [0]	|
  0.044 [1]	|


Latency distribution:
  10%% in 0.0033 secs
  25%% in 0.0035 secs
  50%% in 0.0037 secs
  75%% in 0.0043 secs
  90%% in 0.0052 secs
  95%% in 0.0061 secs
  99%% in 0.0083 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0033 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0018 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0003 secs
  resp wait:	0.0041 secs, 0.0001 secs, 0.0435 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0068 secs

Status code distribution:
  [200]	184418 responses