bench-http/results/round3-sequential.hey.txt

Summary:
  Total:	15.0030 secs
  Slowest:	0.0164 secs
  Fastest:	0.0001 secs
  Average:	0.0033 secs
  Requests/sec:	15266.1954
  
  Total data:	458076 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.002 [1768]	|
  0.003 [164469]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.005 [60459]	|■■■■■■■■■■■■■■■
  0.007 [2000]	|
  0.008 [249]	|
  0.010 [40]	|
  0.012 [21]	|
  0.013 [7]	|
  0.015 [14]	|
  0.016 [10]	|


Latency distribution:
  10%% in 0.0028 secs
  25%% in 0.0030 secs
  50%% in 0.0031 secs
  75%% in 0.0035 secs
  90%% in 0.0041 secs
  95%% in 0.0043 secs
  99%% in 0.0050 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0034 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0002 secs
  resp wait:	0.0033 secs, 0.0001 secs, 0.0135 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0003 secs

Status code distribution:
  [200]	229038 responses