bench-http/results/round4-fanout.hey.txt

Summary:
  Total:	15.0039 secs
  Slowest:	0.0271 secs
  Fastest:	0.0001 secs
  Average:	0.0041 secs
  Requests/sec:	12144.8298
  
  Total data:	364440 bytes
  Size/request:	2 bytes

Response time histogram:
  0.000 [1]	|
  0.003 [1077]	|
  0.006 [172305]	|■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.008 [7753]	|■■
  0.011 [529]	|
  0.014 [279]	|
  0.016 [99]	|
  0.019 [112]	|
  0.022 [34]	|
  0.024 [21]	|
  0.027 [10]	|


Latency distribution:
  10%% in 0.0035 secs
  25%% in 0.0037 secs
  50%% in 0.0039 secs
  75%% in 0.0043 secs
  90%% in 0.0050 secs
  95%% in 0.0055 secs
  99%% in 0.0072 secs

Details (average, fastest, slowest):
  DNS+dialup:	0.0000 secs, 0.0000 secs, 0.0037 secs
  DNS-lookup:	0.0000 secs, 0.0000 secs, 0.0020 secs
  req write:	0.0000 secs, 0.0000 secs, 0.0019 secs
  resp wait:	0.0041 secs, 0.0001 secs, 0.0271 secs
  resp read:	0.0000 secs, 0.0000 secs, 0.0069 secs

Status code distribution:
  [200]	182220 responses